Repository: pypi-data/pypi-mirror-354
Catalog: packages/gtk-llm-chat/gtk_llm_chat-4.0.5.tar.gz/gtk_llm_chat-4.0.5/po/*/LC_MESSAGES/gtk-llm-chat.po
Languages: de, pt, zh

source: Model Settings
de: Modelleinstellungen
pt: Configurações do modelo
zh: 模型设置

source: Rename
de: Umbenennen
pt: Renomear
zh: 重命名

source: Send
de: Senden
pt: Enviar
zh: 发送

source: Model
de: Modell
pt: Modelo
zh: 模型

source: Change Model
de: Modell wechseln
pt: Alterar modelo
zh: 更改模型

source: Provider
de: Anbieter
pt: Provedor
zh: 提供者

source: Set as Default Model
de: Als Standardmodell festlegen
pt: Definir como modelo padrão
zh: 设为默认模型

source: Model Parameters
de: Modellparameter
pt: Parâmetros do modelo
zh: 模型参数

source: Conversation
zh: 对话

source: Delete Conversation
de: Konversation löschen
pt: Apagar conversa
zh: 删除对话

source: Information
de: Informationen
pt: Informação
zh: 信息

source: About
de: Über
pt: Sobre
zh: 关于

source: Actions
de: Aktionen
pt: Ações
zh: 操作

source: Model Selector
zh: 模型选择器

source: Temperature
de: Temperatur
pt: Temperatura
zh: 温度

source: System Prompt
pt: Prompt do sistema
zh: 系统提示

source: Parameters
de: Parameter
pt: Parâmetros
zh: 参数

source: Unknown Provider
de: Unbekannter Anbieter
pt: Provedor desconhecido
zh: 未知提供者

source: Set Default Model
de: Standardmodell festlegen
pt: Definir modelo padrão
zh: 设置默认模型

source: Do you want to set
de: Möchten Sie festlegen
pt: Deseja definir
zh: 您想将模型

source: from
de: von
pt: de
zh: （来自提供者：

source: as the default model for new conversations?
de: als Standardmodell für neue Unterhaltungen?
pt: como modelo padrão para novas conversas?
zh: ）设置成新对话的默认模型吗？

source: Cancel
de: Abbrechen
pt: Cancelar
zh: 取消

source: Set as Default
de: Als Standard festlegen
pt: Definir como padrão
zh: 设为默认

source: set as default
de: als Standard festgelegt
pt: definido como padrão
zh: 已设为默认

source: Set System Prompt
de: System-Prompt festlegen
pt: Definir prompt do sistema
zh: 设置系统提示

source: Enter the system prompt for the AI model:
de: Geben Sie den System-Prompt für das KI-Modell ein:
pt: Digite o prompt do sistema para o modelo de IA:
zh: 请输入 AI 模型的系统提示：

source: Set
de: Festlegen
pt: Definir
zh: 设置

source: Current
de: Aktuell
pt: Atual
zh: 当前

source: Not set
de: Nicht festgelegt
pt: Não definido
zh: 未设置

source: This is the current default model
de: Dies ist das aktuelle Standardmodell
pt: Este é o modelo padrão atual
zh: 这是当前的默认模型

source: Set as default model
de: Als Standardmodell festlegen
pt: Definir como modelo padrão
zh: 设为默认模型

source: Providers
de: Anbieter
pt: Provedores
zh: 提供者

source: Models
de: Modelle
pt: Modelos
zh: 模型

source: Select Provider
de: Anbieter auswählen
pt: Selecionar provedor
zh: 选择提供者

source: Select Model
de: Modell auswählen
pt: Selecionar modelo
zh: 选择模型

source: No models found
de: Keine Modelle gefunden
pt: Nenhum modelo encontrado
zh: 未找到模型

source: models
de: Modelle
pt: Modelos
zh: 模型

source: API key required
de: API-Schlüssel erforderlich
pt: Chave API obrigatória
zh: 需要 API 密钥

source: No models
de: Keine Modelle gefunden
pt: Nenhum modelo encontrado
zh: 无模型

source: API Key is configured
de: API-Schlüssel ist konfiguriert
pt: Chave API configurada
zh: API 密钥已配置

source: Change Key
de: Schlüssel ändern
pt: Alterar chave
zh: 更改密钥

source: API Key Required
de: API-Schlüssel erforderlich
pt: Chave API obrigatória
zh: 需要 API 密钥

source: Set Key
de: Schlüssel festlegen
pt: Definir chave
zh: 设置密钥

source: No models available
de: Keine Modelle verfügbar
pt: Nenhum modelo disponível
zh: 无可用模型

source: Configure an API key to access models from this provider
de: Konfigurieren Sie einen API-Schlüssel, um auf Modelle dieses Anbieters zuzugreifen
pt: Configure uma chave API para aceder a modelos deste provedor
zh: 配置 API 密钥以访问此提供者的模型

source: No models found for this provider
de: Für diesen Anbieter wurden keine Modelle gefunden
pt: Nenhum modelo encontrado para este provedor
zh: 此提供者未找到模型

source: Enter API Key
de: API-Schlüssel eingeben
pt: Digite a chave API
zh: 输入 API 密钥

source: Enter the API key for
de: API-Schlüssel eingeben für
pt: Digite a chave API para
zh: 请输入 API 密钥：

source: Paste your API key here
de: Fügen Sie hier Ihren API-Schlüssel ein
pt: Cole sua chave API aqui
zh: 请在此粘贴您的 API 密钥

source: Model Selector Test
de: Modellauswahl-Test
pt: Teste do Seletor de Modelo
zh: 模型选择器测试

source: New Conversation
de: Neue Konversation
pt: Nova Conversa
zh: 新的对话

source: Quit
de: Beenden
pt: Sair
zh: 退出

source: Closing application...
de: Anwendung wird geschlossen...
pt: A fechar a aplicação...
zh: 正在关闭应用程序...

source: LLM Conversations
de: LLM-Unterhaltungen
pt: Conversas LLM
zh: LLM 对话

source: Tray applet
pt: Applet da bandeja
zh: 托盘应用

source: Default Model
de: Standardmodell
pt: Modelo Padrão
zh: 默认模型

source: Next
de: Weiter
pt: Próximo
zh: 下一步

source: Own the conversation.
de: Behalten Sie die Kontrolle über die Unterhaltung.
pt: Controle a conversa.
zh: 掌控对话。

source: Use any model you want. Your conversations are stored locally.
de: Verwenden Sie jedes gewünschte Modell. Ihre Unterhaltungen werden lokal gespeichert.
pt: Use qualquer modelo que desejar. Suas conversas são armazenadas localmente.
zh: 使用任何您想要的模型。您的对话存储在本地。

source: This wizard will guide you through the initial setup
de: Dieser Assistent führt Sie durch die Ersteinrichtung
pt: Este assistente irá guiá-lo através da configuração inicial
zh: 此向导将引导您完成初始设置

source: Start
pt: Iniciar
zh: 开始

source: Access conversations from the convenience of your system tray
de: Greifen Sie bequem über Ihr System-Tray auf Unterhaltungen zu
pt: Aceda a conversas a partir da conveniência da sua bandeja do sistema
zh: 从系统托盘便捷访问对话

source: Would you like to start the applet with your session?
de: Möchten Sie das Applet mit Ihrer Sitzung starten?
pt: Gostaria de iniciar o applet com a sua sessão?
zh: 您想随会话启动此应用吗？

source: Yes, with my session
de: Ja, mit meiner Sitzung
pt: Sim, com a minha sessão
zh: 是的，随会话启动

source: No, only when I start the app
de: Nein, nur wenn ich die App starte
pt: Não, apenas quando eu iniciar a aplicação
zh: 不，仅当我启动应用时

source: Loading model selection...
de: Modellauswahl wird geladen...
pt: A carregar seleção de modelo...
zh: 正在加载模型选择...

source: Ready to start!
de: Bereit zum Start!
pt: Pronto para começar!
zh: 准备开始！

source: Set API Key
zh: 设置 API 密钥

source: Change API Key
zh: 更改 API 密钥

source: Error: _version.py not found
de: Fehler: _version.py nicht gefunden
pt: Erro: _version.py não encontrado
zh: 错误：找不到 _version.py

source: Are you sure you want to delete the conversation?
de: Sind Sie sicher, dass Sie die Konversation löschen möchten?
pt: Tem a certeza que quer apagar a conversa?
zh: 你确定要删除对话吗？

source: Delete
de: Löschen
pt: Apagar
zh: 删除

source: Gtk LLM Chat
zh: Gtk LLM 聊天

source: A frontend for LLM
de: Ein Frontend für LLM
pt: Um frontend para LLM
zh: LLM 的前端

source: Please select a provider from the list on the left. Then, choose a model from the list that appears here.
de: Bitte wählen Sie einen Anbieter aus der Liste links aus. Dann wählen Sie ein Modell aus der hier erscheinenden Liste.
pt: Por favor, selecione um provedor da lista à esquerda. Depois, escolha um modelo da lista que aparece aqui.
zh: 请从左侧列表中选择一个提供商。 然后，从这里出现的列表中选择一个模型。

source: Most AI models require an API key
de: Die meisten KI-Modelle erfordern einen API-Schlüssel
pt: A maioria dos modelos de IA requer uma chave API
zh: 大多数 AI 模型需要 API 密钥

source: You'll need to register with each provider to obtain these authentication tokens.
de: Sie müssen sich bei jedem Anbieter registrieren, um diese Authentifizierungstoken zu erhalten.
pt: Precisará de se registar em cada provedor para obter estes tokens de autenticação.
zh: 您需要向每个提供者注册以获取这些身份验证令牌。

source: No Selection
de: Keine Auswahl
pt: Nenhuma seleção
zh: 未选择

source: No models or providers found.
de: Keine Modelle gefunden
pt: Nenhum modelo encontrado
zh: 未找到模型或提供者。

source: Error
de: Fehler
pt: Erro
zh: 错误

source: Model information not available
de: Modellinformationen nicht verfügbar
pt: Informação do modelo não disponível
zh: 模型信息不可用

source: Unable to retrieve model details
de: Modelldetails konnten nicht abgerufen werden
pt: Não foi possível obter os detalhes do modelo
zh: 无法检索模型详细信息

source: Aliases
de: Aliase
zh: 别名

source: API Key
de: API-Schlüssel eingeben
pt: Chave API
zh: API 密钥

source: Required • Set
de: Erforderlich • Festgelegt
pt: Obrigatório • Definido
zh: 必需 • 已设置

source: Required • Not set
de: Erforderlich • Nicht festgelegt
pt: Obrigatório • Não definido
zh: 必需 • 未设置

source: Not required
de: Nicht erforderlich
pt: Não obrigatório
zh: 非必需

source: Unknown
zh: 未知

source: Plugin
zh: 插件

source: Another instance is already running.
de: Eine andere Instanz läuft bereits.
pt: Outra instância já está em execução.
zh: 另一个实例已在运行。

source: LLMClient: Ignoring invalid temperature:
de: LLMClient: Ignoriere ungültige Temperatur:
pt: LLMClient: A ignorar temperatura inválida:
zh: LLMClient：忽略无效温度：

source: LLMClient: Starting stream processing...
de: LLMClient: Starte Stream-Verarbeitung...
pt: LLMClient: A iniciar o processamento de stream...
zh: LLMClient：开始流处理...

source: LLMClient: Stream processing cancelled externally.
de: LLMClient: Stream-Verarbeitung wurde extern abgebrochen.
pt: LLMClient: Processamento de stream cancelado externamente.
zh: LLMClient：流处理已在外部取消。

source: LLMClient: Stream finished normally.
de: LLMClient: Stream wurde normal beendet.
pt: LLMClient: Stream terminado normalmente.
zh: LLMClient：流已正常完成。

source: Local/Other
de: Lokal/Andere
pt: Local/Outro
zh: 本地/其他
